[TRShieldGenerator X2EquipmentTemplate]
FriendlyName="Shield Generator"
FriendlyNamePlural="Shield Generator"
BriefSummary="Utility item that provides limited amount of shield regeneration. Helps to extend soldier's survivability in combat"
TacticalText="<Bullet/> Grants shield regeneration for limited charges.<br/><Bullet/> Works in combination of other equipments that provide ablative shield points" 

[TRShieldRegenAbility X2AbilityTemplate]
LocFriendlyName="Shield Generator"
LocLongDescription="Shields regenerate."
LocHelpText="Shields regenerate."
LocFlyOverText="Shield Regen"